stressTesting/getReviews.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "1 request per second"
  # -duration: 60
  # arrivalRate: 10
  # name: 10 request per second
  # -duration: 60
  # arrivalRate: 100
  # name: 100 request per second
variables:
  productIds:
    - ['43434']
    - ['34']
    - ['263']
scenarios:
  - name: "get review metadata"
    flow:
      - loop:
        - get:
            url: "/reviews/{{ $loopElement }}/meta"
        over: productIds